EDT/УТ/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МСК</name>
      <description>МСК</description>
    </items>
    <items>
      <name>СПб</name>
      <description>СПб</description>
    </items>
  </predefined>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыФизЛиц/ДополнительныеПараметрыФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыФизЛиц</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнаяРольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.КадровоеПеремещениеРаботниковОрганизаций</types>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛичногоТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.зпГруппыФизлиц</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНетМонет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
//Переварюха В.В. 2019.09.23 10-45 Задача № 3441
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Родитель.Терминал) Тогда
		Отказ = Истина;
		Сообщить("Невозможно создание элемента вне группы с заполненным Терминалом");
		Возврат;
	КонецЕсли;
	
	ДатаРождения = Объект.ФизЛицо.ДатаРождения;
	ВозможностьРедактированияНаименования = РольДоступна("РедактированиеНаименованияСотрудников");
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		СтруктураДополнительныхПараметровФизЛицо = РегистрыСведений.ДополнительныеПараметрыФизЛиц.ИнициализироватьДополнительныеПараметры(Объект.ФизЛицо);
		
		ОсновнаяРоль = СтруктураДополнительныхПараметровФизЛицо.ОсновнаяРольСотрудника;
		
	Иначе
		Объект.ФизЛицо	= Неопределено;
		Фамилия			= "";
		Имя				= "";
		Отчество		= "";
		Объект.Наименование = "";	
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСФизЛицамиКлиент.ЗаполнитьФИО(ЭтаФорма);
	//Геннадий 09.06.2020 ->
	РаботаСФизЛицамиКлиент.ЗаполнитьПрочиеПараметры(ЭтаФорма);
	//Геннадий 09.06.2020 <-
	РаботаСФизЛицамиКлиент.ДоступностьНаименованияИФИО(ЭтаФорма);
	
КонецПроцедуры
//Переварюха В.В. 2019.09.23 10-45 Задача № 3441

&НаСервере
Функция СопоставитьСотрудникаИФизЛицо()
	
	//Переварюха В.В. 2019.09.23 11-20 Задача № 3441
	
	Если НЕ Объект.Ссылка.Пустая() И Объект.ФизЛицо.Пустая() Тогда
		
		ДлинаНаименования = СтрДлина(Объект.Наименование);
		
		ПервыйПробел = СтрНайти(Объект.Наименование, " ");
		
			Фамилия 	= Лев(Объект.Наименование, ПервыйПробел - 1);
		
		СтрокаИмяОтчество = Прав(Объект.Наименование, ДлинаНаименования - ПервыйПробел);
		
		ВторойПробел = СтрНайти(СтрокаИмяОтчество, " ");
		
		Если ВторойПробел = 0 Тогда
			
			Имя 		=  СтрокаИмяОтчество;
			
			Отчество 	= "";
			
		Иначе
		
			Имя 		=  Лев(СтрокаИмяОтчество, ВторойПробел - 1);
			
			Отчество 	= Прав(СтрокаИмяОтчество, (СтрДлина(СтрокаИмяОтчество) - ВторойПробел));
		
		КонецЕсли;

	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка,
		|	ФизическиеЛица.Фамилия КАК Фамилия,
		|	ФизическиеЛица.Имя КАК Имя,
		|	ФизическиеЛица.Отчество КАК Отчество,
		|	ФизическиеЛица.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФЛ = РезультатЗапроса.Выбрать();
	
	Если ВыборкаФЛ.Количество() = 1 Тогда
		
		ВыборкаФЛ.Следующий();
		
		Возврат ВыборкаФЛ.Ссылка;
		
		//обновить запись в регистре РаботникиОрганизации
	
	КонецЕсли;
	
	Пока ВыборкаФЛ.Следующий() Цикл
		
	//"однофамильцы"	
		
	КонецЦикла;
	
	
	Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	//Переварюха В.В. 2019.09.23 11-20 Задача № 3441
	
		
КонецФункции // СопоставитьСотрудникаИФизЛицо()


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	
	//ЗАГЛУШКА Переварюха В.В. 2019.09.24 Задача № 3441 
	Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не установлена группа";
		Сообщение.Сообщить();
		
	    Отказ = Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(ПолучитьГруппу(Объект.Родитель)) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан терминал группы";
		Сообщение.Сообщить();
		
	    Отказ = Истина;
	КонецЕсли;
	
	//Переварюха В.В. 2019.09.23 11-35 Задача № 3441
	Если РаботаСФизЛицамиКлиент.ПроверитьЗаполнениеПоляФормы(ЭтаФорма, "Фамилия")
		ИЛИ РаботаСФизЛицамиКлиент.ПроверитьЗаполнениеПоляФормы(ЭтаФорма, "Имя")
		ИЛИ РаботаСФизЛицамиКлиент.ПроверитьЗаполнениеПоляФормы(ЭтаФорма, "ДатаРождения") Тогда
		Отказ = Истина;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		
		Если ПроверкаФИО Тогда
			Отказ = РаботаСФизЛицамиКлиент.ПроверитьФИО(ЭтаФорма);
		КонецЕсли; 
		
		Если НЕ Отказ И НЕ ПроверкаФИО Тогда
			
			СтароеФИО = РаботаСФизЛицамиКлиент.НаименованиеФИОВСтруктуру(Объект.ФизЛицо);
			
			//Геннадий 10.06.2020 ->			
			Если РаботаСФизЛицамиКлиент.ФИОНеСовпадает(СтароеФИО, Фамилия, Имя, Отчество) 
				ИЛИ ДРПоменялось ИЛИ НомерТелПоменялся ИЛИ КомментарийПоменялся Тогда
			//Геннадий 10.06.2020 <-			
				
				МассивОднофамильцев = ОбработатьНаименованиеИФизЛицо(СтароеФИО);
				
				Если Объект.ФизЛицо.Пустая() Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "ВНИМАНИЕ!!! Запись невозможна!"+Символы.ПС+"Физ. лицо с таким ФИО уже существует и привязано к другому сотруднику!";
					Сообщение.Поле = "Наименование";
					Сообщение.Сообщить(); 
					
					Отказ = Истина;
				КонецЕсли;
				
				РаботаСФизЛицамиКлиент.СообщитьОднофамильцев(МассивОднофамильцев);
				
			КонецЕсли; 
						
		КонецЕсли; 
		
	КонецЕсли;

	//Переварюха В.В. 2019.09.23 11-35 Задача № 3441

КонецПроцедуры

//Переварюха В.В. 2019.09.23 11-35 Задача № 3441
&НаСервере
Функция ОбработатьНаименованиеИФизЛицо(СтароеФИО) 
		
	//Геннадий 11.06.2020 ->
	//добавлена передача параметров НомерЛичногоТелефона, КомментарийФЛ
	Объект.ФизЛицо = Справочники.ФизическиеЛица.ОбработатьФизЛицо(Объект.ФизЛицо, Объект.Родитель.Терминал, Фамилия, Имя, Отчество, ДатаРождения, Тип("СправочникСсылка.Сотрудники"), НомерЛичногоТелефона, КомментарийФЛ);
	//Геннадий 11.06.2020 <-
	
	Если (НЕ Объект.НаименованиеИзменено) ИЛИ (ПустаяСтрока(Объект.Наименование)) Тогда
		Объект.Наименование = Фамилия + " " + Имя + " " + Отчество;
	КонецЕсли; 

	
	Если НЕ Объект.ФизЛицо.Пустая() Тогда
			
		МассивОднофамильцев = Справочники.ФизическиеЛица.ПроверитьОднофамильцев(Объект.ФизЛицо);
		
		Если (МассивОднофамильцев.Количество() > 0) И (НЕ Объект.НаименованиеИзменено) Тогда
			Объект.Наименование = Фамилия + " " + Имя + " " + Отчество + " (" + Формат(ДатаРождения, "ДЛФ=Д") + ")";
		КонецЕсли;
		
		Возврат МассивОднофамильцев;
		
	КонецЕсли;
	
	МассивОднофамильцев = Новый Массив;
	
	Возврат МассивОднофамильцев; 
	
КонецФункции // ()


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если МодифицированностьДопПараметров Тогда
		//Марочкин закомментировано 08.12.2023
		//РегистрыСведений.ДополнительныеПараметрыФизЛиц.ДобавлениеИзменениеПараметровФизЛица(Объект.ФизЛицо, ОсновнаяРоль);
		//Марочкин закомментировано 08.12.2023
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеИзмененоПриИзменении(Элемент)
	
	РаботаСФизЛицамиКлиент.ДоступностьНаименованияИФИО(ЭтаФорма);
	
	Если НЕ Объект.НаименованиеИзменено Тогда
		РаботаСФизЛицамиКлиент.ЗаполнитьНаименование(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ДатаРожденияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСФизЛицамиКлиент.ПроверитьСменуДатыРождения(Текст, ЭтаФорма);

	
КонецПроцедуры


&НаКлиенте
Процедура ДатаРожденияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСФизЛицамиКлиент.ПроверитьСменуДатыРождения(ВыбранноеЗначение, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	РаботаСФизЛицамиКлиент.ФИОПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	РаботаСФизЛицамиКлиент.ФИОПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	РаботаСФизЛицамиКлиент.ФИОПриИзменении(ЭтаФорма);
КонецПроцедуры


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПолучитьГруппу(Родитель)

	Возврат Родитель.ПолучитьОбъект().Терминал	

КонецФункции // ПолучитьГруппу()

//Геннадий 10.06.2020 ->
&НаКлиенте
Процедура НомерЛичногоТелефонаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РаботаСФизЛицамиКлиент.ПроверитьСменуТелефона(Текст, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийФЛОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РаботаСФизЛицамиКлиент.ПроверитьСменуКомментария(Текст, ЭтаФорма);
КонецПроцедуры
//Геннадий 10.06.2020 <-
